// Ivan4.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//4. Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними S км.
//Определить расстояние между ними через T часов, если автомобили удаляются друг от друга.

#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	float v1, v2, s, t;
	cout << "Введите скорость первого автомобиля :) " << endl;
	cin >> v1;
	cout << "Введите скорость второго автомобиля :) " << endl;
	cin >> v2;
	cout << "Введите расстояние между автомобилями :) " << endl;
	cin >> s;
	cout << "Введите время, в течение которого автомобили удалялись друг от друга (в часах) " << endl;
	cin >> t;
	s = s + t * (v1 + v2);
	cout << "Расстояние между ними через " << t << " часов = " << s << endl;

	return 0;
}